# -*- coding: utf-8 -*-
# Auther : jianlong
list1 = [('周一', '麻辣小龙虾', 23, 9.8, '罗宋汤'),
         ('周二', '宫保鸡丁', 12, 9.8, '紫菜蛋花汤'),
         ('周三', '水煮肉片', 32, 9.8, '西湖牛肉羹汤'),
         ('周四', '果儿拌菜', 19, 9.8, '番茄鸡蛋汤'),
         ('周五', '小鸡炖蘑菇', 33, 9.8, '米酒小汤圆')]
str_0 = "{}特价{} {}元,赠送一份价值{:f}的{}"
for c1 in list1:
    print(str_0.format(c1[0], c1[1], c1[2], c1[3], c1[4]))
str_1 = '饭店不仅每天有特价,为了回馈新老客户到店就送价值  的精美礼品,凭结账小票可进行抽奖''\n一等奖:  价值  欧洲游  ''\n二等奖:  价值  的豆浆机  ' '\n三等奖:  价值200元的生活大礼包'
print(str_1)


print("sds".strip('s'))