# -*- coding: utf-8 -*-
# Auther : jianlong
book_info = {
    "book_name": "English Listening Training",  # 书名
    "total_chapter": 10,  # 总章节
    "finished_chapter": "",  # 完成章节
    "avg_score": 0,  # 平均得分
    "wrong_ques_num": 0,  # 错题数量
    "user_name": ""  # 学生姓名
}
xiaomu = book_info.copy()
tom = book_info.copy()
Kate = book_info.copy()
xiaomu.update({'finished_chapter': 8, 'avg_score': 95.5, 'wrong_ques_num': 12, 'user_name': 'xiaomu'})
print(xiaomu)

movies = {
    "沉默的羔羊": "1991-02-14",
    "不可饶恕": "1992-08-03",
    "辛德勒的名单": "1993-11-30",
    "阿甘正传": "1994-06-23",
    "勇敢的心": "1995-05-18",
    "英国病人": "1996-12-06",
    "泰坦尼克号": "1997-12-19",
    "莎翁情史": "1998-12-11",
    "美国丽人": "1999-09-08",
    "角斗士": "2000-05-05",
    "美丽心灵": "2001-12-13",
    "芝加哥": "2002-12-27",
    "指环王：国王归来": "2003-12-17",
    "百万美元宝贝": "2004-12-15",
    "撞车": "2005-09-10",
    "无间行者": "2006-09-26",
    "老无所依": "2007-05-19",
    "贫民窟的百万富翁": "2008-08-30",
    "拆弹部队": "2009-09-04",
    "国王的演讲": "2010-09-06",
    "艺术家": "2011-10-12",
    "逃离德黑兰": "2012-08-31",
    "为奴十二年": "2013-11-08",
    "鸟人": "2014-08-27",
    "聚焦": "2015-09-03",
    "月光男孩": "2016-09-02",
    "水形物语": "2017-08-31",
    "绿皮书": "2018-09-11",
    "寄生虫": "2019-05-21",
    "无依之地 [4]": " 2020-09-11",
    '健听女孩': '2021-09-01',
    '瞬息全宇宙': '2022-09-01'
}

print('肖申克的救赎' in movies)
print('楚门的世界' in movies)
print('泰坦尼克号' in movies)

print(movies.popitem())
print(movies)
movies.pop('寄生虫')

print(not bool('寄生虫'))

